{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "border_mode": "same", "trainable": true, "b_regularizer": null, "name": "convolution2d_1", "batch_input_shape": [null, 32, 32, 3], "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 32, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "b_regularizer": null, "name": "convolution2d_2", "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 32, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "trainable": true, "b_regularizer": null, "name": "convolution2d_3", "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "b_regularizer": null, "name": "convolution2d_4", "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 512, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "activation": "linear", "b_constraint": null, "input_dim": null, "trainable": true, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "activation": "linear", "b_constraint": null, "input_dim": null, "trainable": true, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}}]}