{"config": [{"config": {"b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_1", "bias": true, "W_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "init": "glorot_uniform", "batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "nb_filter": 32, "border_mode": "same", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_2", "bias": true, "W_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_3", "bias": true, "W_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "border_mode": "same", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_4", "bias": true, "W_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 512, "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "name": "dense_2", "W_constraint": null, "output_dim": 1, "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}