{"keras_version": "1.1.2", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, null, null, 3], "name": "input_1", "input_dtype": "float32"}}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [2, 2], "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_1", "gamma_regularizer": null}}, {"name": "convolution2d_2", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_2", "gamma_regularizer": null}}, {"name": "convolution2d_3", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_3", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_3", "gamma_regularizer": null}}, {"name": "maxpooling2d_1", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "valid"}}, {"name": "convolution2d_4", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_4", "b_regularizer": null, "nb_filter": 80, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_4", "gamma_regularizer": null}}, {"name": "convolution2d_5", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_5", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_5", "gamma_regularizer": null}}, {"name": "maxpooling2d_2", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "valid"}}, {"name": "convolution2d_9", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_9", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_9", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_9", "gamma_regularizer": null}}, {"name": "convolution2d_7", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_7", "b_regularizer": null, "nb_filter": 48, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_10", "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_10", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_7", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_7", "gamma_regularizer": null}}, {"name": "batchnormalization_10", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_10", "gamma_regularizer": null}}, {"name": "averagepooling2d_1", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "averagepooling2d_1", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "same"}}, {"name": "convolution2d_6", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_6", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_8", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_8", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_11", "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_11", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_12", "inbound_nodes": [[["averagepooling2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_12", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_6", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_6", "gamma_regularizer": null}}, {"name": "batchnormalization_8", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_8", "gamma_regularizer": null}}, {"name": "batchnormalization_11", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_11", "gamma_regularizer": null}}, {"name": "batchnormalization_12", "inbound_nodes": [[["convolution2d_12", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_12", "gamma_regularizer": null}}, {"name": "mixed0", "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]], "class_name": "Merge", "config": {"arguments": {}, "concat_axis": 3, "mode": "concat", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "dot_axes": -1, "name": "mixed0"}}, {"name": "convolution2d_16", "inbound_nodes": [[["mixed0", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_16", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_16", "inbound_nodes": [[["convolution2d_16", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_16", "gamma_regularizer": null}}, {"name": "convolution2d_14", "inbound_nodes": [[["mixed0", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_14", "b_regularizer": null, "nb_filter": 48, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_17", "inbound_nodes": [[["batchnormalization_16", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_17", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_14", "inbound_nodes": [[["convolution2d_14", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_14", "gamma_regularizer": null}}, {"name": "batchnormalization_17", "inbound_nodes": [[["convolution2d_17", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_17", "gamma_regularizer": null}}, {"name": "averagepooling2d_2", "inbound_nodes": [[["mixed0", 0, 0]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "averagepooling2d_2", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "same"}}, {"name": "convolution2d_13", "inbound_nodes": [[["mixed0", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_13", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_15", "inbound_nodes": [[["batchnormalization_14", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_15", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_18", "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_18", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_19", "inbound_nodes": [[["averagepooling2d_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_19", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_13", "inbound_nodes": [[["convolution2d_13", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_13", "gamma_regularizer": null}}, {"name": "batchnormalization_15", "inbound_nodes": [[["convolution2d_15", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_15", "gamma_regularizer": null}}, {"name": "batchnormalization_18", "inbound_nodes": [[["convolution2d_18", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_18", "gamma_regularizer": null}}, {"name": "batchnormalization_19", "inbound_nodes": [[["convolution2d_19", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_19", "gamma_regularizer": null}}, {"name": "mixed1", "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_15", 0, 0], ["batchnormalization_18", 0, 0], ["batchnormalization_19", 0, 0]]], "class_name": "Merge", "config": {"arguments": {}, "concat_axis": 3, "mode": "concat", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "dot_axes": -1, "name": "mixed1"}}, {"name": "convolution2d_23", "inbound_nodes": [[["mixed1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_23", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_23", "inbound_nodes": [[["convolution2d_23", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_23", "gamma_regularizer": null}}, {"name": "convolution2d_21", "inbound_nodes": [[["mixed1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_21", "b_regularizer": null, "nb_filter": 48, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_24", "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_24", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_21", "inbound_nodes": [[["convolution2d_21", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_21", "gamma_regularizer": null}}, {"name": "batchnormalization_24", "inbound_nodes": [[["convolution2d_24", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_24", "gamma_regularizer": null}}, {"name": "averagepooling2d_3", "inbound_nodes": [[["mixed1", 0, 0]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "averagepooling2d_3", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "same"}}, {"name": "convolution2d_20", "inbound_nodes": [[["mixed1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_20", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_22", "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_22", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_25", "inbound_nodes": [[["batchnormalization_24", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_25", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_26", "inbound_nodes": [[["averagepooling2d_3", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_26", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_20", "inbound_nodes": [[["convolution2d_20", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_20", "gamma_regularizer": null}}, {"name": "batchnormalization_22", "inbound_nodes": [[["convolution2d_22", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_22", "gamma_regularizer": null}}, {"name": "batchnormalization_25", "inbound_nodes": [[["convolution2d_25", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_25", "gamma_regularizer": null}}, {"name": "batchnormalization_26", "inbound_nodes": [[["convolution2d_26", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_26", "gamma_regularizer": null}}, {"name": "mixed2", "inbound_nodes": [[["batchnormalization_20", 0, 0], ["batchnormalization_22", 0, 0], ["batchnormalization_25", 0, 0], ["batchnormalization_26", 0, 0]]], "class_name": "Merge", "config": {"arguments": {}, "concat_axis": 3, "mode": "concat", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "dot_axes": -1, "name": "mixed2"}}, {"name": "convolution2d_28", "inbound_nodes": [[["mixed2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_28", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_28", "inbound_nodes": [[["convolution2d_28", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_28", "gamma_regularizer": null}}, {"name": "convolution2d_29", "inbound_nodes": [[["batchnormalization_28", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_29", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_29", "inbound_nodes": [[["convolution2d_29", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_29", "gamma_regularizer": null}}, {"name": "convolution2d_27", "inbound_nodes": [[["mixed2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [2, 2], "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_27", "b_regularizer": null, "nb_filter": 384, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_30", "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "b_constraint": null, "subsample": [2, 2], "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_30", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_27", "inbound_nodes": [[["convolution2d_27", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_27", "gamma_regularizer": null}}, {"name": "batchnormalization_30", "inbound_nodes": [[["convolution2d_30", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_30", "gamma_regularizer": null}}, {"name": "maxpooling2d_3", "inbound_nodes": [[["mixed2", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_3", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "valid"}}, {"name": "mixed3", "inbound_nodes": [[["batchnormalization_27", 0, 0], ["batchnormalization_30", 0, 0], ["maxpooling2d_3", 0, 0]]], "class_name": "Merge", "config": {"arguments": {}, "concat_axis": 3, "mode": "concat", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "dot_axes": -1, "name": "mixed3"}}, {"name": "convolution2d_35", "inbound_nodes": [[["mixed3", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_35", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_35", "inbound_nodes": [[["convolution2d_35", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_35", "gamma_regularizer": null}}, {"name": "convolution2d_36", "inbound_nodes": [[["batchnormalization_35", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_36", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_36", "inbound_nodes": [[["convolution2d_36", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_36", "gamma_regularizer": null}}, {"name": "convolution2d_32", "inbound_nodes": [[["mixed3", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_32", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_37", "inbound_nodes": [[["batchnormalization_36", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_37", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_32", "inbound_nodes": [[["convolution2d_32", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_32", "gamma_regularizer": null}}, {"name": "batchnormalization_37", "inbound_nodes": [[["convolution2d_37", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_37", "gamma_regularizer": null}}, {"name": "convolution2d_33", "inbound_nodes": [[["batchnormalization_32", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_33", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_38", "inbound_nodes": [[["batchnormalization_37", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_38", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_33", "inbound_nodes": [[["convolution2d_33", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_33", "gamma_regularizer": null}}, {"name": "batchnormalization_38", "inbound_nodes": [[["convolution2d_38", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_38", "gamma_regularizer": null}}, {"name": "averagepooling2d_4", "inbound_nodes": [[["mixed3", 0, 0]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "averagepooling2d_4", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "same"}}, {"name": "convolution2d_31", "inbound_nodes": [[["mixed3", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_31", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_34", "inbound_nodes": [[["batchnormalization_33", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_34", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_39", "inbound_nodes": [[["batchnormalization_38", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_39", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_40", "inbound_nodes": [[["averagepooling2d_4", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_40", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_31", "inbound_nodes": [[["convolution2d_31", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_31", "gamma_regularizer": null}}, {"name": "batchnormalization_34", "inbound_nodes": [[["convolution2d_34", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_34", "gamma_regularizer": null}}, {"name": "batchnormalization_39", "inbound_nodes": [[["convolution2d_39", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_39", "gamma_regularizer": null}}, {"name": "batchnormalization_40", "inbound_nodes": [[["convolution2d_40", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_40", "gamma_regularizer": null}}, {"name": "mixed4", "inbound_nodes": [[["batchnormalization_31", 0, 0], ["batchnormalization_34", 0, 0], ["batchnormalization_39", 0, 0], ["batchnormalization_40", 0, 0]]], "class_name": "Merge", "config": {"arguments": {}, "concat_axis": 3, "mode": "concat", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "dot_axes": -1, "name": "mixed4"}}, {"name": "convolution2d_45", "inbound_nodes": [[["mixed4", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_45", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_45", "inbound_nodes": [[["convolution2d_45", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_45", "gamma_regularizer": null}}, {"name": "convolution2d_46", "inbound_nodes": [[["batchnormalization_45", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_46", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_46", "inbound_nodes": [[["convolution2d_46", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_46", "gamma_regularizer": null}}, {"name": "convolution2d_42", "inbound_nodes": [[["mixed4", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_42", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_47", "inbound_nodes": [[["batchnormalization_46", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_47", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_42", "inbound_nodes": [[["convolution2d_42", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_42", "gamma_regularizer": null}}, {"name": "batchnormalization_47", "inbound_nodes": [[["convolution2d_47", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_47", "gamma_regularizer": null}}, {"name": "convolution2d_43", "inbound_nodes": [[["batchnormalization_42", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_43", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_48", "inbound_nodes": [[["batchnormalization_47", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_48", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_43", "inbound_nodes": [[["convolution2d_43", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_43", "gamma_regularizer": null}}, {"name": "batchnormalization_48", "inbound_nodes": [[["convolution2d_48", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_48", "gamma_regularizer": null}}, {"name": "averagepooling2d_5", "inbound_nodes": [[["mixed4", 0, 0]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "averagepooling2d_5", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "same"}}, {"name": "convolution2d_41", "inbound_nodes": [[["mixed4", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_41", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_44", "inbound_nodes": [[["batchnormalization_43", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_44", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_49", "inbound_nodes": [[["batchnormalization_48", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_49", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_50", "inbound_nodes": [[["averagepooling2d_5", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_50", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_41", "inbound_nodes": [[["convolution2d_41", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_41", "gamma_regularizer": null}}, {"name": "batchnormalization_44", "inbound_nodes": [[["convolution2d_44", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_44", "gamma_regularizer": null}}, {"name": "batchnormalization_49", "inbound_nodes": [[["convolution2d_49", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_49", "gamma_regularizer": null}}, {"name": "batchnormalization_50", "inbound_nodes": [[["convolution2d_50", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_50", "gamma_regularizer": null}}, {"name": "mixed5", "inbound_nodes": [[["batchnormalization_41", 0, 0], ["batchnormalization_44", 0, 0], ["batchnormalization_49", 0, 0], ["batchnormalization_50", 0, 0]]], "class_name": "Merge", "config": {"arguments": {}, "concat_axis": 3, "mode": "concat", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "dot_axes": -1, "name": "mixed5"}}, {"name": "convolution2d_55", "inbound_nodes": [[["mixed5", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_55", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_55", "inbound_nodes": [[["convolution2d_55", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_55", "gamma_regularizer": null}}, {"name": "convolution2d_56", "inbound_nodes": [[["batchnormalization_55", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_56", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_56", "inbound_nodes": [[["convolution2d_56", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_56", "gamma_regularizer": null}}, {"name": "convolution2d_52", "inbound_nodes": [[["mixed5", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_52", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_57", "inbound_nodes": [[["batchnormalization_56", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_57", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_52", "inbound_nodes": [[["convolution2d_52", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_52", "gamma_regularizer": null}}, {"name": "batchnormalization_57", "inbound_nodes": [[["convolution2d_57", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_57", "gamma_regularizer": null}}, {"name": "convolution2d_53", "inbound_nodes": [[["batchnormalization_52", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_53", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_58", "inbound_nodes": [[["batchnormalization_57", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_58", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_53", "inbound_nodes": [[["convolution2d_53", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_53", "gamma_regularizer": null}}, {"name": "batchnormalization_58", "inbound_nodes": [[["convolution2d_58", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_58", "gamma_regularizer": null}}, {"name": "averagepooling2d_6", "inbound_nodes": [[["mixed5", 0, 0]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "averagepooling2d_6", "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "same"}}, {"name": "convolution2d_51", "inbound_nodes": [[["mixed5", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_51", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_54", "inbound_nodes": [[["batchnormalization_53", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 7, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_54", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_59", "inbound_nodes": [[["batchnormalization_58", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 7, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_59", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "convolution2d_60", "inbound_nodes": [[["averagepooling2d_6", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_col": 1, "init": "glorot_uniform", "nb_row": 1, "trainable": false, "b_constraint": null, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_60", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "dim_ordering": "tf"}}, {"name": "batchnormalization_51", "inbound_nodes": [[["convolution2d_51", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_51", "gamma_regularizer": null}}, {"name": "batchnormalization_54", "inbound_nodes": [[["convolution2d_54", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, "epsilon": 1e-05, "name": "batchnormalization_54", "gamma_regularizer": null}}, {"name": "batchnormalization_59", "inbound_nodes": [[["convolution2d_59", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "trainable": false, "momentum": 0.99, "beta_regularizer": null, "axis": 3, 