{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Flatten", "config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "flatten_1"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batchnormalization_1", "axis": -1, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05, "beta_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "name": "dense_1", "activation": "linear", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 128, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "name": "dense_2", "activation": "linear", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "b_constraint": null}}]}