{"keras_version": "1.1.2", "config": [{"config": {"subsample": [1, 1], "batch_input_shape": [null, 32, 32, 3], "border_mode": "same", "trainable": true, "name": "convolution2d_1", "input_dtype": "float32", "activation": "linear", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 32, "nb_row": 3, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"subsample": [1, 1], "nb_filter": 32, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "name": "convolution2d_2", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "nb_filter": 64, "border_mode": "same", "trainable": true, "activation": "linear", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "name": "convolution2d_3", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"subsample": [1, 1], "nb_filter": 64, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "name": "convolution2d_4", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 512, "bias": true, "name": "dense_1", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "bias": true, "name": "dense_2", "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}