{"keras_version": "1.1.2", "config": [{"config": {"name": "convolution2d_1", "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "nb_col": 3, "trainable": true, "input_dtype": "float32", "nb_row": 3, "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "W_constraint": null, "nb_filter": 32, "subsample": [1, 1], "bias": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_2", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "trainable": true, "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_filter": 32, "subsample": [1, 1], "bias": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "nb_col": 3, "trainable": true, "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_4", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "trainable": true, "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "linear", "W_regularizer": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "output_dim": 512}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activation": "linear", "W_regularizer": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}