{"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_2", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, null, null, 3], "input_dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [2, 2], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "trainable": false, "nb_filter": 32, "W_constraint": null, "activation": "relu", "name": "convolution2d_1", "init": "glorot_uniform"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_1", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "trainable": false, "nb_filter": 32, "W_constraint": null, "activation": "relu", "name": "convolution2d_2", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_2", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_2", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_3", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_3", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_3", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "valid", "W_regularizer": null, "trainable": false, "nb_filter": 80, "W_constraint": null, "activation": "relu", "name": "convolution2d_4", "init": "glorot_uniform"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_4", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_4", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_5", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_5", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_5", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_9", "init": "glorot_uniform"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_9", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_9", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 48, "W_constraint": null, "activation": "relu", "name": "convolution2d_7", "init": "glorot_uniform"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 96, "W_constraint": null, "activation": "relu", "name": "convolution2d_10", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_7", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_7", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_10", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_10", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_1", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [1, 1], "name": "averagepooling2d_1", "border_mode": "same"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_6", "init": "glorot_uniform"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 5, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_8", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 96, "W_constraint": null, "activation": "relu", "name": "convolution2d_11", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_12", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 32, "W_constraint": null, "activation": "relu", "name": "convolution2d_12", "init": "glorot_uniform"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_6", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_6", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_8", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_8", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_11", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_11", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_12", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_12", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Merge", "name": "mixed0", "config": {"output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "name": "mixed0", "arguments": {}, "concat_axis": 3, "output_mask_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_16", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_16", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_16", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_16", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_14", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 48, "W_constraint": null, "activation": "relu", "name": "convolution2d_14", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_17", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 96, "W_constraint": null, "activation": "relu", "name": "convolution2d_17", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_14", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_14", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_17", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_17", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_2", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [1, 1], "name": "averagepooling2d_2", "border_mode": "same"}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_13", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_13", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_15", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 5, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_15", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_18", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 96, "W_constraint": null, "activation": "relu", "name": "convolution2d_18", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_19", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 32, "W_constraint": null, "activation": "relu", "name": "convolution2d_19", "init": "glorot_uniform"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_13", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_13", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_15", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_15", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_18", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_18", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_19", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_19", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"class_name": "Merge", "name": "mixed1", "config": {"output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "name": "mixed1", "arguments": {}, "concat_axis": 3, "output_mask_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_15", 0, 0], ["batchnormalization_18", 0, 0], ["batchnormalization_19", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_23", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_23", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_23", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_23", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_23", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_21", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 48, "W_constraint": null, "activation": "relu", "name": "convolution2d_21", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_24", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 96, "W_constraint": null, "activation": "relu", "name": "convolution2d_24", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_23", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_21", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_21", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_21", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_24", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_24", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_24", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_3", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [1, 1], "name": "averagepooling2d_3", "border_mode": "same"}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_20", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_20", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_22", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 5, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_22", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_21", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_25", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 96, "W_constraint": null, "activation": "relu", "name": "convolution2d_25", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_24", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_26", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 32, "W_constraint": null, "activation": "relu", "name": "convolution2d_26", "init": "glorot_uniform"}, "inbound_nodes": [[["averagepooling2d_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_20", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_20", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_20", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_22", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_22", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_22", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_25", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_25", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_25", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_26", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_26", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_26", 0, 0]]]}, {"class_name": "Merge", "name": "mixed2", "config": {"output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "name": "mixed2", "arguments": {}, "concat_axis": 3, "output_mask_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["batchnormalization_20", 0, 0], ["batchnormalization_22", 0, 0], ["batchnormalization_25", 0, 0], ["batchnormalization_26", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_28", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "activation": "relu", "name": "convolution2d_28", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_28", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_28", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_28", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_29", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 96, "W_constraint": null, "activation": "relu", "name": "convolution2d_29", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_28", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_29", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_29", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_29", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_27", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [2, 2], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "trainable": false, "nb_filter": 384, "W_constraint": null, "activation": "relu", "name": "convolution2d_27", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_30", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [2, 2], "bias": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "trainable": false, "nb_filter": 96, "W_constraint": null, "activation": "relu", "name": "convolution2d_30", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_29", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_27", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_27", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_27", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_30", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_30", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_30", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_3", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid"}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"class_name": "Merge", "name": "mixed3", "config": {"output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "name": "mixed3", "arguments": {}, "concat_axis": 3, "output_mask_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["batchnormalization_27", 0, 0], ["batchnormalization_30", 0, 0], ["maxpooling2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_35", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 128, "W_constraint": null, "activation": "relu", "name": "convolution2d_35", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_35", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_35", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_35", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_36", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 128, "W_constraint": null, "activation": "relu", "name": "convolution2d_36", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_35", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_36", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_36", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_36", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_32", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 128, "W_constraint": null, "activation": "relu", "name": "convolution2d_32", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_37", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 128, "W_constraint": null, "activation": "relu", "name": "convolution2d_37", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_36", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_32", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_32", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_32", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_37", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_37", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_37", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_33", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 128, "W_constraint": null, "activation": "relu", "name": "convolution2d_33", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_32", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_38", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 128, "W_constraint": null, "activation": "relu", "name": "convolution2d_38", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_37", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_33", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_33", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_33", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_38", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_38", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_38", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_4", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [1, 1], "name": "averagepooling2d_4", "border_mode": "same"}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_31", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_31", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_34", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_34", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_33", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_39", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_39", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_38", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_40", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_40", "init": "glorot_uniform"}, "inbound_nodes": [[["averagepooling2d_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_31", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_31", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_31", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_34", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_34", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_34", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_39", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_39", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_39", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_40", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_40", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_40", 0, 0]]]}, {"class_name": "Merge", "name": "mixed4", "config": {"output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "name": "mixed4", "arguments": {}, "concat_axis": 3, "output_mask_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["batchnormalization_31", 0, 0], ["batchnormalization_34", 0, 0], ["batchnormalization_39", 0, 0], ["batchnormalization_40", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_45", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_45", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_45", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_45", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_45", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_46", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_46", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_45", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_46", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_46", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_46", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_42", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_42", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_47", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_47", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_46", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_42", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_42", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_42", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_47", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_47", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_47", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_43", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_43", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_42", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_48", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_48", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_47", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_43", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_43", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_43", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_48", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_48", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_48", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_5", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [1, 1], "name": "averagepooling2d_5", "border_mode": "same"}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_41", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_41", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_44", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_44", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_43", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_49", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_49", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_48", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_50", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_50", "init": "glorot_uniform"}, "inbound_nodes": [[["averagepooling2d_5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_41", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_41", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_41", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_44", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_44", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_44", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_49", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_49", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_49", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_50", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_50", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_50", 0, 0]]]}, {"class_name": "Merge", "name": "mixed5", "config": {"output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "name": "mixed5", "arguments": {}, "concat_axis": 3, "output_mask_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["batchnormalization_41", 0, 0], ["batchnormalization_44", 0, 0], ["batchnormalization_49", 0, 0], ["batchnormalization_50", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_55", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_55", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_55", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_55", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_55", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_56", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_56", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_55", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_56", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_56", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_56", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_52", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_52", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_57", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_57", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_56", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_52", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_52", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_52", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_57", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_57", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_57", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_53", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_53", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_52", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_58", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 160, "W_constraint": null, "activation": "relu", "name": "convolution2d_58", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_57", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_53", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_53", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_53", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_58", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_58", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_58", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_6", "config": {"dim_ordering": "tf", "trainable": false, "pool_size": [3, 3], "strides": [1, 1], "name": "averagepooling2d_6", "border_mode": "same"}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_51", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_51", "init": "glorot_uniform"}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_54", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_54", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_53", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_59", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 7, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_59", "init": "glorot_uniform"}, "inbound_nodes": [[["batchnormalization_58", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_60", "config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "trainable": false, "nb_filter": 192, "W_constraint": null, "activation": "relu", "name": "convolution2d_60", "init": "glorot_uniform"}, "inbound_nodes": [[["averagepooling2d_6", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_51", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_51", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_51", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_54", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_54", "gamma_regularizer": null, "axis": 3}, "inbound_nodes": [[["convolution2d_54", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_59", "config": {"epsilon": 1e-05, "trainable": false, "mode": 0, "beta_regularizer": null, 