{"config": [{"config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 128, "activation": "linear", "b_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "activation": "linear", "b_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}