{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 32, "activation": "linear", "b_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "name": "convolution2d_1", "border_mode": "same", "bias": true, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 3, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 32, "b_regularizer": null, "activation": "linear", "name": "convolution2d_2", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 3, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 64, "b_regularizer": null, "activation": "linear", "name": "convolution2d_3", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "border_mode": "same", "bias": true, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 3, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 64, "b_regularizer": null, "activation": "linear", "name": "convolution2d_4", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 3, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "name": "dense_1", "input_dim": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "bias": true, "output_dim": 512, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "name": "dense_2", "input_dim": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "bias": true, "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}], "keras_version": "1.1.2"}