{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "name": "convolution2d_1", "nb_row": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "nb_filter": 32, "batch_input_shape": [null, 32, 32, 3], "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "activation": "linear", "nb_col": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_2", "nb_row": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "nb_filter": 32, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_3", "nb_row": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "nb_col": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_4", "nb_row": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 512, "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "bias": true, "W_constraint": null}}]}