{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "activation": "linear", "bias": true, "W_constraint": null, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "border_mode": "same", "nb_col": 3, "name": "convolution2d_1", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "nb_col": 3, "name": "convolution2d_2", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_col": 3, "name": "convolution2d_3", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "nb_col": 3, "name": "convolution2d_4", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "W_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 512, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "W_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 1, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "b_regularizer": null}}], "keras_version": "1.1.2"}